[metadata]
creation_date = "2023/12/11"

[rule]
author = ["Mounir Hedna"]
description = "Test Update"
from = "now-6m"
name = "Test Update"
risk_score = 100
severity = "medium"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000099"
query = '''
event.dataset: zeek.http and url.extension : bat and not destination.port : 80
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.003"
name = "Windows Command Shell"
reference = "https://attack.mitre.org/techniques/T1059/003/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
